[
    {
        "ch":[
            "sparky",
            "ribbon"
        ],
        "desc":"Ribbon and Sparky have the same birthday, though Ribbon was two years older than Sparky. Ribbon showed Sparky the ropes around Hillslope, taught her to cook and bake, and asked her to investigate the attack on [Starry](../starry/). Sparky was about to take all the caring she gave her for granted. She couldn't have been more mistaken.\n\n*Gratitude gets you far, Sparky. Very far.*"
    },
    {
        "ch": [
            "sparky",
            "amber"
        ],
        "desc": "Sparky is Amber's daughter. Sparky loves her almost obsessively. Amber seems to be more focused on [Willow](../willow/), however."
    },
    {
        "ch": [
            "sparky",
            "peacock"
        ],
        "desc": "Peacock is Sparky's step-father ~~and reincarnation~~. Sparky hates him because he didn't match up to the perfect father (Jackal) in her mind.\n\nPeacock, on the other hand, is deep in conflict as he both hates who he was in the past, but also desparately wants to *be* who he was in the past."
    },
    {
        "ch": [
            "sparky",
            "willow"
        ],
        "desc": "Willow is Sparky's half-sister, with the same mother ([Amber](../amber/)) but different fathers. Willow is the one who understands Sparky the most, because of her mind-reading."
    },
    {
        "ch": [
            "sparky",
            "ironheart"
        ],
        "desc": "Ironheart is Sparky's step-brother. Sparky and Ironheart are locked in an eternal childish sibling rivalry despite not meeting each other for very long and growing into adults."
    },
    {
        "ch": [
            "sparky",
            "nightsun"
        ],
        "desc": "Sparky is Nightsun's wife.\n\nThey're both bisexual and deep in the closet. They both know the other is bisexual. They're both trying all sorts of gimmicks to make the other come out.\n\nNightsun is an agent sent to get close to Sparky in order to get information on [Animus](../animus/). (No, I don't know who sent him, gimme some time.) Sparky knows this. He knows she knows. She knows he know she knows. They both pretend to not know anything."
    },
    {
        "ch": [
            "jerboa",
            "tephra"
        ],
        "desc": "Jerboa is Tephra's little pet. He does everything Tephra tells him to do."
    }
]