[
  {
    "ch": [
      [
        "Sparky",
        "daughter"
      ],
      [
        "Amber",
        "mother"
      ]
    ],
    "desc": "Sparky loves Amber almost obsessively. Amber seems to be more focused on [Willow](/characters/willow/), however."
  },
  {
    "ch": [
      [
        "Sparky",
        "stepdaughter"
      ],
      [
        "Peacock",
        "stepfather"
      ]
    ],
    "desc": "Peacock is Sparky's step-father ~~and reincarnation~~. Sparky hates him because he didn't match up to the perfect father (Jackal) in her mind.\n\nPeacock, on the other hand, is deep in conflict as he both hates who he was in the past, but also desperately wants to *be* who he was in the past."
  },
  {
    "ch": [
      [
        "Sparky",
        "older half-sister"
      ],
      [
        "Willow",
        "younger half-sister"
      ]
    ],
    "img": "sparky willow.png",
    "desc": "Sparky and Willow have the [same mother](/characters/amber/) but different fathers.\n\nWillow is the one who understands Sparky the most, because of her mind-reading."
  },
  {
    "ch": [
      [
        "Sparky",
        "friend"
      ],
      [
        "Ribbon",
        "friend"
      ]
    ],
    "desc": "Sparky loves hanging out in Ribbon's bakery. Ribbon taught her how to bake."
  },
  {
    "ch": [
      [
        "Sparky",
        "friend"
      ],
      [
        "Qibli",
        "friend"
      ]
    ],
    "desc": "Sparky and Qibli became friends through [Sky](/characters/sky/). She is always trying to pull Qibli out of her own world and make her hang out with Sky and [Firecrackers](/characters/firecrackers/)."
  },
  {
    "ch": [
      [
        "Sparky",
        "friend"
      ],
      [
        "Sky",
        "friend"
      ]
    ],
    "desc": "Sparky got assigned to sit next to Sky on their first day of [Middle School](/world/bauhinia/coastline/cms/). The stuff he did -- twirl cards, take photos, being able to recognize any sort of tank at one glance -- fascinated her. Though she wouldn't admit it, she had a little crush on him. The crush later turned to a big crush on [Nightsun](/characters/nightsun/).\n\nAs for Sky, he is always looking for new friends."
  },
  {
    "ch": [
      [
        "Sparky",
        "friend"
      ],
      [
        "Firecrackers",
        "friend"
      ]
    ],
    "desc": "What's the difference between their cursing? Sparky does it unconsiously; she treats curses like like normal words. But Firecrackers curses intentionally, just to piss people off."
  },
  {
    "ch": [
      [
        "Sparky",
        "classmates"
      ],
      [
        "Myriad",
        "classmates"
      ]
    ],
    "desc": "Myriad worked with Sparky on the thief case. They had a fair share of conflicts, as Myriad disapproved of Sparky's recklessness and Sparky thought Myriad was dull. In the end, Sparky framed Myriad for all the theft and got her sent to juvie."
  },
  {
    "ch": [
      [
        "Sparky",
        "younger stepsister"
      ],
      [
        "Fantasy",
        "older stepsister"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Sparky",
        "younger stepsister"
      ],
      [
        "Ironheart",
        "older stepbrother"
      ]
    ],
    "img": "sparky ironheart interrogation.png",
    "desc": "Sparky and Ironheart are locked in an eternal childish sibling rivalry despite growing into adults."
  },
  {
    "ch": [
      [
        "Sparky",
        "wife"
      ],
      [
        "Nightsun",
        "husband"
      ]
    ],
    "img": "sparky and nightsun spinning.png",
    "desc": "They're both bisexual and deep in the closet. They both know the other is bisexual. They're both trying all sorts of gimmicks to make the other come out.\n\n---\n\nNightsun used to be a no-names [Starcorp](/world/bauhinia/starcorp/) employee in the headquarters in Coastline. Sparky developed a huge crush on him and kept trying to get close to him despite warnings from Animus. After [Fantasy](/characters/fantasy/) died and [Bramble](/characters/bramble/) became her child, she proposed to Nightsun and they got married.\n\nOnce they got married, Sparky started to exert control over him like she did everyone. She made Nightsun quit his job and stay at home to take care of Bramble. He did, so now Bramble likes him (\"papa!\") more than he likes Sparky (\"auntie\"), and now she's mad about it.\n\nLittle did she know, Nightsun was a spy sent to get information on Animus. After Animus found out, Sparky refused to let anything happen to Nightsun because she still loved him, and believed that he reciprocated, and also Bramble liked him too much. Animus decided to feed false information through Nightsun, though he didn't want Nightsun to know. Sparky, however, came clean to him about running him as a double agent.\n\nNightsun agreed, because deep down, he loved Sparky too."
  },
  {
    "ch": [
      [
        "Sparky",
        "aunt (legal guardian)"
      ],
      [
        "Bramble",
        "nephew"
      ]
    ],
    "desc": "Bramble still refers to Sparky as his aunt even when he calls [Nightsun](/characters/nightsun/) his dad. Sparky is really mad about it. She really did care about Bramble. Now I wonder where I've seen this before... Ah yes, Sparky calling Peacock \"Peacock.\"\n\nBramble also constantly pesters Sparky into telling him what happened to [his mom](/characters/fantasy/), because \"Auntie knows *everything*!\" Truth is, Sparky would also very much like to know what happened to Fantasy."
  },
  {
    "ch": [
      [
        "Sparky"
      ],
      [
        "Pearl"
      ]
    ],
    "img": "sparky & pearl stand.png",
    "desc": "Sparky took care of Pearl like she's her daughter. However, as they ran out of money and was struggling to move forward in [Sylvandia](/world/sylvandia/), she found herself also looking at Pearl and seeing not a person, but a machine for producing pearls."
  },
  {
    "ch": [
      [
        "Sparky",
        "frienemy"
      ],
      [
        "Devotion",
        "frienemy"
      ]
    ],
    "desc": "Sparky and Devotion have the exact same pistol so they always have fights about whose pistol is better. They are. Exactly. The. Same. Colt 1911 (didn't the [industrial revolution](/world/history/) *just* break out in 1911? Whatever I don't care). But apparently Devotion's gun is retired from the military while Sparky's is bought off the civilian market."
  },
  {
    "ch": [
      [
        "Sparky",
        "friend"
      ],
      [
        "Elegance",
        "friend"
      ]
    ],
    "desc": "Sparky and Elegance are good friends. There was this time when Elegance was kidnapped, and Sparky refused to leave her side, so she got kidnapped with her.\n\nSparky's superstrength distorts Elegance's perception of time, though they didn't know this at first."
  },
  {
    "ch": [
      [
        "Sparky",
        "friend / bodyguard"
      ],
      [
        "Animus",
        "friend / principal"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Amber",
        "wife"
      ],
      [
        "Peacock",
        "husband"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Amber",
        "mother"
      ],
      [
        "Willow",
        "daughter"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Amber",
        "stepmother"
      ],
      [
        "Fantasy",
        "stepdaughter"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Peacock",
        "father"
      ],
      [
        "Willow",
        "daughter"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Peacock",
        "father"
      ],
      [
        "Fantasy",
        "daughter"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Peacock",
        "father"
      ],
      [
        "Ironheart",
        "son"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Peacock",
        "friend / lawyer"
      ],
      [
        "Hyrax",
        "friend"
      ]
    ],
    "desc": "Peacock and Hyrax met in juvie and became great friends. Hyrax invited Peacock into Starcorp to be his ~~lawyer~~ professional butt-wiper."
  },
  {
    "ch": [
      [
        "Willow",
        "younger half-sister"
      ],
      [
        "Fantasy",
        "older half-sister"
      ]
    ],
    "desc": "Fantasy and Willow have the [same father](/characters/peacock/) but different mothers."
  },
  {
    "ch": [
      [
        "Willow",
        "younger half-sister"
      ],
      [
        "Ironheart",
        "older half-brother"
      ]
    ],
    "desc": "Willow and Ironheart have the [same father](/characters/peacock/) but different mothers."
  },
  {
    "ch": [
      [
        "Willow",
        "girlfriend?"
      ],
      [
        "Sundae",
        "girlfriend?"
      ]
    ],
    "desc": "Willow met Sundae when she was in middle school and Sundae in college. They often sneaked out to meet each other (mostly Willow, since Sundae doesn't really need to sneak).\n\nWillow's entire family (mainly, [Peacock](/characters/peacock/), [Sparky](/characters/sparky/), [Ironheart](/characters/ironheart/), and [Fantasy](/characters/fantasy/)) was against their relationship, either because Willow was too young, or homophobia, or both.\n\nEventually they split up because 15-year-olds just *should* be sleeping in and being a total idiot rather than dating."
  },
  {
    "ch": [
      [
        "Qibli",
        "childhood friend"
      ],
      [
        "Sky",
        "childhood friend"
      ]
    ],
    "desc": "Qibli and Sky have known each other since kindergarten. Their parents, Donut and Dazzle, are colleagues, which is why they often put Qibli and Sky together. Embarrasingly, they used to say they wanted to marry each other when they grew up. They no longer want to do that.\n\nThey're both nerdy as fuck, but Sky thinks it's cool while Qibli thinks she is boring. Sky would try all sort of things to convince her being nerdy is cool."
  },
  {
    "ch": [
      [
        "Qibli",
        "friend"
      ],
      [
        "Firecrackers",
        "friend"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Qibli",
        "friend / classmate"
      ],
      [
        "Trinket",
        "friend / classmate"
      ]
    ],
    "desc": "Qibli and Trinket met in the Magic Academy. Trinket's magic is far more powerful than Qibli's, and she would teach Qibli to do a lot of spells she figured out on her own.\n\nQibli and Trinket's biggest difference is this: Trinket is mischevious and annoying to adults, but she's not a rule-breaker. Qibli is quiet and the teacher's pet, but she would break the law in a heartbeat -- it would even give her the thrills.\n\nThat's how come their friendship broke over the discovery of the Incredible Banned Book of Illegal Magic (placeholder title). Qibli loved it. Trinket wouldn't let her touch it."
  },
  {
    "ch": [
      [
        "Sky"
      ],
      [
        "Firecrackers",
        "friend"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Sky",
        "apprentice"
      ],
      [
        "Goose",
        "shimu"
      ]
    ],
    "desc": "Goose's first very own apprentice is Sky."
  },
  {
    "ch": [
      [
        "Tomato",
        "twin"
      ],
      [
        "Potato",
        "twin"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Fantasy",
        "older half-sister"
      ],
      [
        "Ironheart",
        "younger half-brother"
      ]
    ],
    "desc": "Fantasy and Ironheart have the [same father](/characters/peacock/) but different mothers."
  },
  {
    "ch": [
      [
        "Fantasy",
        "mother"
      ],
      [
        "Bramble",
        "son"
      ]
    ],
    "desc": "Bramble doesn't remember many things about his mom, but he remembers enough to say \"Auntie is mean, I love mama.\""
  },
  {
    "ch": [
      [
        "Ironheart",
        "husband"
      ],
      [
        "Beauty",
        "wife"
      ]
    ],
    "desc": "Of course it's a part of an arranged marriage. But who's to say they never had feelings for each other?"
  },
  {
    "ch": [
      [
        "Ironheart",
        "father"
      ],
      [
        "Bunchberry",
        "daughter"
      ]
    ],
    "desc": "Ironheart would *not* tolerate his \"son\" taking random drugs. Bunny does it behind his back anyways."
  },
  {
    "ch": [
      [
        "Nightsun",
        "stepfather"
      ],
      [
        "Bramble",
        "stepson"
      ]
    ],
    "desc": "Nightsun spends most of his time around Bramble after he quit his job after marrying [Sparky](/characters/sparky/). So naturally, Bramble likes him more. Nightsun, however, hates kids. He's just to scared to show it in front of Sparky.\n\nBramble thinks his papa is the best chef in the world. "
  },
  {
    "ch": [
      [
        "Nightsun",
        "agent"
      ],
      [
        "Groovy",
        "case officer"
      ]
    ],
    "desc": "Nightsun only knows Groovy as \"Cocoa.\""
  },
  {
    "ch": [
      [
        "Goose",
        "colleague / friend"
      ],
      [
        "Pumpkin",
        "colleague / friend"
      ]
    ],
    "desc": "Pumpkin and Goose are on the same team in the MSS, both on the younger side. They have a very pure and goofy friendship, always willing to help each other out, and always ready to laugh at each other when they do something stupid (which is often)."
  },
  {
    "ch": [
      [
        "Goose",
        "subordinate"
      ],
      [
        "Halcyon",
        "superior"
      ]
    ],
    "desc": "Halcyon and Goose are on the same team. Goose trusted and looked up to Halcyon, treating him like another shifu; and Halcyon kept her in the dark about his treason.\n\nWhen Halcyon was outed as a traitor and a murderer, Goose felt betrayed. She poured all her anger into the interrogation, torturing him into spitting out his soul, until he spilled all his secrets.\n\nIf Halcyon's betrayal had merely been \"business\" mixed with a bit of bribery and coercion before, now he had nothing but animosity towards Bauhinia and its system. As for Goose, this was just the start of her journey of becoming the queen of torture."
  },
  {
    "ch": [
      [
        "Goose",
        "apprentice"
      ],
      [
        "Paperweight",
        "shifu"
      ]
    ],
    "desc": "Paperweight is constantly annoyed that Goose didn't live up to his expectations."
  },
  {
    "ch": [
      [
        "Goose",
        "arch nemesis"
      ],
      [
        "Jackalope",
        "arch nemesis"
      ]
    ],
    "img": "goose jackalope.png",
    "desc": "Goose and Jackalope had never met each other. They only know each other by code names. If they were to meet, they would have become great friends; but they became enemies because of the countries they respectively served.\n\nMaybe on late, sleepless nights, they would lie awake wondering what the girl over there looked like. Did she like gardening too? Did she cry when the protagonists of that trashy soap opera broke up too? What kind of a person was she?\n\nThey could look into the iron curtain and stare at their reflections. That might as well be her."
  },
  {
    "ch": [
      [
        "Pumpkin",
        "apprentice"
      ],
      [
        "Halcyon",
        "shifu"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Pumpkin"
      ],
      [
        "Paperweight",
        "superior"
      ]
    ],
    "desc": "Paperweight hates Pumpkin because he's so annoying. Also because he's jealous at how Pumpkin was smarter and stronger than him. And that he's mad at himself for growing old.\n\nIf Pumpkin pulled out a boba tea in front of him, he would take it and dump the entire thing down the drain while forcing Pumpkin to watch.\n\nAlso he thinks Pumpkin is a weirdo because Paperweight is homophobic as fuck.\n\nPumpkin quite reveres Paperweight, and is especially curious about the \"legend\" he created. At the same time he was also scared of him, because fuck knows how he's going to be tortured if Paperweight finds out about his treason."
  },
  {
    "ch": [
      [
        "Pumpkin",
        "boyfriend"
      ],
      [
        "Candlelight",
        "boyfriend"
      ]
    ],
    "desc": "Pumpkin and Candlelight met each other on a train to their little [village](/world/westavia/pumpkins-village/) in Westavia. Pumpkin, being on the run from the [MSS](/world/bauhinia/mss/), used a fake name \"Curly.\"\n\nCandlelight had just suffered a break-up and the two quickly (well, the train was very long and boring) fell in love with each other."
  },
  {
    "ch": [
      [
        "Pumpkin",
        "distant relative"
      ],
      [
        "Helsinki",
        "distant relative"
      ]
    ],
    "desc": "Helsinki's and Pumpkin's grandparents were related somewhat."
  },
  {
    "ch": [
      [
        "Paperweight",
        "apprentice"
      ],
      [
        "Whiteout",
        "shimu"
      ]
    ],
    "desc": "Paperweight reverred Whiteout. Whiteout cared for Paperweight."
  },
  {
    "ch": [
      [
        "Pearl",
        "friend"
      ],
      [
        "Snake",
        "friend"
      ]
    ],
    "img": "pearl snake.png",
    "desc": "Pearl and Snake quickly became friends, because for both of them, it was like finally seeing a kid their own age after a life of isolation."
  },
  {
    "ch": [
      [
        "Jackpot",
        "father"
      ],
      [
        "Snake",
        "son"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Beauty",
        "older sister"
      ],
      [
        "Chastity",
        "younger sister"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Beauty",
        "older sister"
      ],
      [
        "Devotion",
        "younger sister"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Beauty",
        "older sister"
      ],
      [
        "Elegance",
        "younger sister"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Beauty",
        "older sister"
      ],
      [
        "Animus",
        "younger brother"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Beauty",
        "daughter"
      ],
      [
        "Hyrax",
        "father"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Beauty",
        "mother"
      ],
      [
        "Bunchberry",
        "daughter"
      ]
    ],
    "desc": "Beauty is also against Bunny transitioning, but she's just less mean about it than Ironheart. She's the kind of parent to say \"you are perfect the way you are.\""
  },
  {
    "ch": [
      [
        "Chastity",
        "older sister"
      ],
      [
        "Devotion",
        "younger sister"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Chastity",
        "older sister"
      ],
      [
        "Elegance",
        "younger sister"
      ]
    ],
    "desc": "Chastity would often threaten to slice up Elegance's plushies with her chainsaw."
  },
  {
    "ch": [
      [
        "Chastity",
        "older sister"
      ],
      [
        "Animus",
        "younger brother"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Chastity",
        "daughter"
      ],
      [
        "Hyrax",
        "father"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Devotion",
        "older sister"
      ],
      [
        "Elegance",
        "younger sister"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Devotion",
        "older sister"
      ],
      [
        "Animus",
        "younger brother"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Devotion",
        "daughter"
      ],
      [
        "Hyrax",
        "father"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Elegance",
        "older sister"
      ],
      [
        "Animus",
        "younger brother"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Elegance",
        "daughter"
      ],
      [
        "Hyrax",
        "father"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Animus",
        "son"
      ],
      [
        "Hyrax",
        "father"
      ]
    ],
    "desc": "Ah, the pride of the family. The precious little son. What Animus don't know is that Hyrax is actually his *uncle* — he asked his brother for a son, and he gave Animus to him."
  },
  {
    "ch": [
      [
        "Hyrax",
        "acquaintance"
      ],
      [
        "Kismet",
        "acquaintance"
      ]
    ],
    "desc": "Of course they know each other. The two most powerful beings in Bauhinia — and probably the entire continent. And of course they're both cishets. The world is run by cishets. It's a cishet world for cishets. If they were gay though I could've shipped them. Too bad :("
  },
  {
    "ch": [
      [
        "Koala",
        "wife"
      ],
      [
        "Kangaroo",
        "husband"
      ]
    ],
    "desc": "Koala and Kangaroo met each other while studying physics in [Moreland](/world/moreland/)."
  },
  {
    "ch": [
      [
        "Koala",
        "mother"
      ],
      [
        "Jaculus",
        "daughter"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Koala",
        "mother"
      ],
      [
        "Jerboa",
        "son"
      ]
    ],
    "desc": "Jerboa doesn't have memories of his mom. His only proof of her existence is a family photo he doesn't remember taking."
  },
  {
    "ch": [
      [
        "Kangaroo",
        "father"
      ],
      [
        "Jaculus",
        "daughter"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Kangaroo",
        "father"
      ],
      [
        "Jerboa",
        "son"
      ]
    ],
    "desc": "Jerboa doesn't have memories of his dad. His only proof of his existence is a family photo he doesn't remember taking."
  },
  {
    "ch": [
      [
        "Robin",
        "father"
      ],
      [
        "Frosting",
        "daughter"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Frosting",
        "BFF"
      ],
      [
        "Jaculus",
        "BFF"
      ]
    ],
    "desc": "Jaculus and Frosting were one of the few kids in the [Project Boomerang](/world/bauhinia/project-boomerang/) laboratory, so they were natually close to each other."
  },
  {
    "ch": [
      [
        "Frosting",
        "acquaintance"
      ],
      [
        "Jerboa",
        "acquaintance"
      ]
    ],
    "desc": "Frosting and Jerboa met through [Tephra](/characters/tephra/) because of his promise to help Jerboa find his family.\n\nFrosting risked her job letting Jerboa look through the archives, partly because she was bored as fuck and partly because she thought that by having Jerboa find out the truth, she was giving her dear friend Jaculus a proper closure too."
  },
  {
    "ch": [
      [
        "Frosting",
        "wife"
      ],
      [
        "Entity",
        "husband"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Frosting",
        "mother"
      ],
      [
        "Harmony",
        "daughter"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Frosting"
      ],
      [
        "Jasmine",
        "crush"
      ]
    ],
    "desc": "Frosting fell in love with Jasmine after copying her file down and reading her poetry."
  },
  {
    "ch": [
      [
        "Frosting",
        "colleague"
      ],
      [
        "Snowstorm",
        "colleague"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Jaculus",
        "older sister"
      ],
      [
        "Jerboa",
        "younger brother"
      ]
    ],
    "desc": "Jerboa faintly remembers playing dolls with Jaculus. She is also in the family photo he doesn't remember taking."
  },
  {
    "ch": [
      [
        "Jerboa"
      ],
      [
        "Tephra",
        "boss"
      ]
    ],
    "desc": "It's possible that Tephra introduced Jerboa to Frosting but i still need to think about it"
  },
  {
    "ch": [
      [
        "Candlelight",
        "suicide watch officer"
      ],
      [
        "Sunflower",
        "suicide watch target"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Candlelight",
        "childhood friend"
      ],
      [
        "Mooncake",
        "childhood friend"
      ]
    ],
    "desc": "Candlelight and Mooncake grew up together. When Candlelight came back to his village after quitting his police job, he was so shocked to find Mooncake also a cop and doing perfectly well. Mooncake was laughing so hard at him. But at the same time she missed him and was glad he came back."
  },
  {
    "ch": [
      [
        "Cobalt",
        "girlfriend"
      ],
      [
        "Kaleidoscope",
        "boyfriend"
      ]
    ],
    "desc": "Cobalt and Kaleidoscope loved each other. When Kally went missing, Co did everything she could to look for him -- she learned soul-extraction from Moonbeam, but it came at a price: Moonbeam kept her body. She led a triad with Nightingale and Skyhawk, and set herself deep into the dark underground of Fantoni organized crime. But when Kally saw her again, she was a totally different woman. Is this body with Co's soul in it, this ruthless black market dealer... still Co?"
  },
  {
    "ch": [
      [
        "Cobalt",
        "friend"
      ],
      [
        "Nightingale",
        "friend"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Cobalt",
        "friend"
      ],
      [
        "Skyhawk",
        "friend"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Cobalt",
        "student"
      ],
      [
        "Moonbeam",
        "mentor"
      ]
    ],
    "desc": "Cobalt turned to Moonbeam to study soul-extraction. She mastered it, but Moonbeam kept her original body, and gave her a new body to travel in. It was unclear how she could get her body back."
  },
  {
    "ch": [
      [
        "Entity",
        "father"
      ],
      [
        "Harmony",
        "daughter"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Entity",
        "executioner"
      ],
      [
        "Gorgeous",
        "crush"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Entity",
        "friend"
      ],
      [
        "Tangerine",
        "friend"
      ]
    ],
    "desc": "Entity and Tangerine met during their soul-extraction training, and became good friends."
  },
  {
    "ch": [
      [
        "Harmony",
        "friend"
      ],
      [
        "Sugarcane",
        "friend"
      ]
    ],
    "desc": "Harmony and Sugarcane are good friends. They grew up together, because their moms were colleagues so they spent a lot of time around each other. (Just like [Qibli](/characters/qibli/) and [Sky](/characters/sky/), yes)."
  },
  {
    "ch": [
      [
        "Harmony",
        "friend"
      ],
      [
        "Jelly",
        "friend"
      ]
    ],
    "desc": "Harmony made friends with Jelly, but it was actually to run her as an agent."
  },
  {
    "ch": [
      [
        "Sugarcane",
        "friend"
      ],
      [
        "Jelly",
        "friend"
      ]
    ],
    "desc": "Sugarcane made friends with Jelly, but it was actually to run her as an agent."
  },
  {
    "ch": [
      [
        "Sugarcane",
        "daughter"
      ],
      [
        "Snowstorm",
        "mother"
      ]
    ],
    "desc": ""
  },
  {
    "ch": [
      [
        "Jelly",
        "daughter"
      ],
      [
        "Checkers",
        "father"
      ]
    ],
    "desc": "Jelly is very reliant on her father, as her mother wasn't allowed to come to Bauhinia. He is the only person she was most close to. Checkers is well aware of this, and tries to cater to his daughter as well as possible."
  }
]